https://github.com/leekh4232/MegaitDataAnalysis/blob/main/C.%20%EB%8D%B0%EC%9D%B4%ED%84%B0%20%EB%8B%A4%EB%A3%A8%EA%B8%B0/02.%20%EB%8D%B0%EC%9D%B4%ED%84%B0%20%EC%A0%84%EC%B2%98%EB%A6%AC/%EC%97%B0%EC%8A%B5%EB%AC%B8%EC%A0%9C.md 참고

In [14]:
from pandas import DataFrame, merge, concat, Series, read_excel, pivot_table

# 문제1

인자의 수준을 나타내는 변수를 class로, 실습값을 time으로 하여 데이터를 구성

### 풀이1) 리스트를 원소로 갖는 딕셔너리 활용
- 딕셔너리의 key가 column 이름이 된다

In [15]:
data = {
    "class" : ['A1', 'A1', 'A1', 'A1','A1',
               'A2', 'A2', 'A2', 'A2', 'A2', 'A2',
               'A3', 'A3', 'A3', 'A3', 'A3', 'A3', 'A3',
               'A4', 'A4', 'A4', 'A4', 'A4', 'A4', 'A4'],
    "time" : [62, 60, 63, 59, 61,
              62, 67, 71, 64, 65, 66,
              68, 66, 71, 67, 68, 69, 70,
              58, 62, 60, 59, 61, 63, 64]
}

In [16]:
df = DataFrame(data)
df

   class  time
0     A1    62
1     A1    60
2     A1    63
3     A1    59
4     A1    61
5     A2    62
6     A2    67
7     A2    71
8     A2    64
9     A2    65
10    A2    66
11    A3    68
12    A3    66
13    A3    71
14    A3    67
15    A3    68
16    A3    69
17    A3    70
18    A4    58
19    A4    62
20    A4    60
21    A4    59
22    A4    61
23    A4    63
24    A4    64

- dictionary 형태로

In [17]:
data2 = [
    {"class":"A1", "time":62},
    {"class":"A1", "time":60},
    {"class":"A1", "time":63},
    {"class":"A1", "time":59},
    {"class":"A1", "time":61},
    {"class":"A2", "time":62},
    {"class":"A2", "time":67},
    {"class":"A2", "time":71},
    {"class":"A2", "time":64},
    {"class":"A2", "time":65},
    {"class":"A2", "time":66},
    {"class":"A3", "time":68},
    {"class":"A3", "time":66},
    {"class":"A3", "time":71},
    {"class":"A3", "time":67},
    {"class":"A3", "time":68},
    {"class":"A3", "time":69},
    {"class":"A3", "time":70},
    {"class":"A4", "time":58},
    {"class":"A4", "time":62},
    {"class":"A4", "time":60},
    {"class":"A4", "time":59},
    {"class":"A4", "time":61},
    {"class":"A4", "time":63},
    {"class":"A4", "time":64},
]

In [18]:
df2 = DataFrame(data2)
df2

   class  time
0     A1    62
1     A1    60
2     A1    63
3     A1    59
4     A1    61
5     A2    62
6     A2    67
7     A2    71
8     A2    64
9     A2    65
10    A2    66
11    A3    68
12    A3    66
13    A3    71
14    A3    67
15    A3    68
16    A3    69
17    A3    70
18    A4    58
19    A4    62
20    A4    60
21    A4    59
22    A4    61
23    A4    63
24    A4    64

- 추가 내용\
생성된 데이터 프레임에 대한 각 변수의 데이터 타입 확인

In [19]:
print(df.dtypes)
print("-"*30)
print(df2.dtypes)

class    object
time      int64
dtype: object
------------------------------
class    object
time      int64
dtype: object

- 추가내용\
데이터 프레임의 여러 컬럼을 일괄 변경해 새로운 데이터프레임 생성\
문자열을 category로 바꾸면 메모리를 적게 소비해 연산 속도 향상

In [20]:
# astype로 범주형 변수 바꾸기1
df3 = df.astype({"class":"category"})
df3.dtypes

class    category
time        int64
dtype: object

- 추가내용\
특정 컬럼의 타입만 변경 후 원본에 바로 적용

In [21]:
# astype로 범주형 변수 바꾸기 2 (원본에 바로 적용)
df['category'] = df['class'].astype('category')
df.dtypes

class         object
time           int64
category    category
dtype: object

- 추가내용\
서열 척도로 변경해야 하는 경우

In [22]:
from pandas import CategoricalDtype
df['class']=df['class'].astype(
    CategoricalDtype(categories=["A1", "A2", "A3", "A4"], ordered=True)
)
df.dtypes

class       category
time           int64
category    category
dtype: object

# 문제 2

In [24]:
df1 = DataFrame([
    {"ID":25, "READ":350, "Math":425, "Grade":7},
    {"ID":27, "READ":425, "Math":375, "Grade":8},
    {"ID":30, "READ":475, "Math":485, "Grade":8},
    {"ID":35, "READ":375, "Math":400, "Grade":9},
])
df1

   ID  READ  Math  Grade
0  25   350   425      7
1  27   425   375      8
2  30   475   485      8
3  35   375   400      9

In [25]:
df2 = DataFrame([
    {"ID":20, "READ":250, "Math":300, "Grade":7},
    {"ID":33, "READ":325, "Math":225, "Grade":9},
    {"ID":37, "READ":300, "Math":375, "Grade":9},
])
df2

   ID  READ  Math  Grade
0  20   250   300      7
1  33   325   225      9
2  37   300   375      9

In [26]:
concat([df1, df2], ignore_index=True)

   ID  READ  Math  Grade
0  25   350   425      7
1  27   425   375      8
2  30   475   485      8
3  35   375   400      9
4  20   250   300      7
5  33   325   225      9
6  37   300   375      9